class Reply:
    ON_START = (
        "*Привет!*\n\n"
        "Этот бот умеет учиться на сообщениях беседы и генерировать рандомные сообщения. Иногда получается даже смешно 🥰\n\n"
        "Для начала, пригласи его в какую-нибудь беседу и *дай ему время для обучения*. "
        "Чтобы проверить, сколько сообщений в базе знаний бота, напиши в беседе /count. "
        "Если сообщений в базе недостаточно, при генерации бот выдаст сообщение об ошибке 😣\n\n"
        "Когда бот научится генерировать сообщения (обычно после 10-20 сообщений), он начнёт автоматически писать в беседу каждые три часа.\n"
        "✨ Чтобы вручную сгенерировать сообщение, напиши в беседу /generate.\n"
        "📍 Остальные команды можно найти, написав /help.\n\n"
        "_Создано в Университете ИТМО_"
    )
    ON_HELP = (
        "*Список команд:*\n"
        "\n"
        "/help - получить список команд\n"
        "/generate - сгенерировать рандомное сообщение. Также можно написать /g или /gen\n"
    )
    ON_MESSAGES_DB_TOO_SMALL = (
        "База слов слишком мала для генерации 😣"
        "\n\n"
        "✨ Попробуй оставить бота в беседе на некоторое время, чтобы он набрался опыта на ваших сообщениях. "
        "Обычно требуется около 10-20 сообщений."
    )
    ON_NOT_IN_GROUP = (
        "🗿 Бот работает только в беседах и суперчатах."
        "\n"
        "Попробуй добавить его в какую-нибудь из своих бесед или создай новую для теста!"
    )
    ON_COUNT_COMMAND_REPLY = (
        "✨ Сохранено {0} строк для обучения"
    )
